/*
    3. Создайте и запустите приложение React, выводящее информацию о кулинарном рецепте в браузер. 
Например: название рецепта, составляющие рецепта (ингредиенты и их количество), последовательность 
приготовления, фотография готового блюда.
    При разработке нужно использовать классовые компоненты и синтаксис JSX.
*/


// Создание компонента "Header" классовый подход
class Header extends React.Component {
    render() {
        return <h2 class="text-center text-primary">Задание 3</h2>
    }
}

// Создание компонента "SubHeader" классовый подход
class SubHeader extends React.Component {
    render() {
        return (
            <React.Fragment>
                <h3 class="h3 text-center">Класичний український борщ</h3>
                <p>Борщ – це страва, яка є родзинкою української кухні й знана в усьому світі. Смачний, ситний, наваристий домашній борщ зігріє та об’єднає всю сім’ю за обіднім столом.</p>
            </React.Fragment>
        )
    }
}

// Создание компонента "Ingredients" классовый подход
class Ingredients extends React.Component {
    render() {
       return (
            <ul class="text-primary">
                <li>Вода (1,5-2 л);</li>
                <li>Свинина або яловичина на кістці (400 г);</li>
                <li>Картопля (4 шт, середні);</li>
                <li>Буряк (2 шт, невеликі);</li>
                <li>Морква (1 шт);</li>
                <li>Цибуля (3 шт, середні)</li>
                <li>Капуста білокачанна свіжа (300 г);</li>
                <li>Томатна паста (2 ст. л.);</li>
                <li>Соняшникова олія (4-5 ст. л.);</li>
                <li>Лимонна кислота (дрібка);</li>
                <li>Сіль, лавровий лист, зелень (за смаком).</li>
            </ul>
       )
    }
}

// Создание компонента "StepByStep" классовый подход
class StepByStep extends React.Component {
    render() {
        return (
            <>
                <p>Спершу варимо бульйон. У каструлю наливаємо 1,5-2 літра води. Додаємо м’ясо й ставимо на середній вогонь. Перед закипанням знімаємо піну. Щойно бульйон закипить, накриваємо кришкою і варимо на повільному вогні годину-півтори.</p>
                <p>Тим часом готуємо засмажку. Чистимо буряк, моркву та цибулю. Буряк натираємо на крупній тертці, а моркву – на середній. Цибулю нарізаємо кубиками.</p>
                <p>На середньому вогні в сковороді розігріваємо олію, висипаємо туди цибулю та моркву, смажимо 5 хвилин. Потім додаємо буряк (його можна посипати лимонною кислотою або збризнути соком свіжого лимона – так борщ буде по-справжньому червоним). Смажимо овочі ще 5 хвилин, додаємо томатну пасту, перемішуємо й смажимо все ще 5-7 хвилин.</p>
                <p>А тепер варимо сам борщ. З бульйону виймаємо м’ясо і, поки воно холоне, кидаємо в бульйон нашатковану капусту. Через 5-10 хвилин додаємо нарізану соломкою картоплю. Відокремлюємо м’ясо від кістки й нарізаємо кубиками. Повертаємо м’ясо в борщ, солимо його і додаємо засмажку. Перемішуємо борщ, кладемо лавровий лист і дрібно посічену зелень, накриваємо кришкою та варимо все ще 5-7 хвилин.</p>
                <p>Подаємо борщ зі сметаною і зеленню.</p>
            </>
        )
    }
}

// Создание компонента "Photo" классовый подход
class Photo extends React.Component {
    render() {
        return <div class="conteiner p-3"><img src="images/borsch.jpg" alt="Борщ" /></div>
    }
}

// Рендеринг компонентов "Header", "SubHeader", "Ingredients", "StepByStep" и "Photo"
ReactDOM.render(
    <React.Fragment>
        <Header />
        <SubHeader />
        <Ingredients />
        <StepByStep />
        <Photo />
    </React.Fragment>,
    document.getElementById("section3")
)